package com.example.demo.interview.question;

public class Shopee {
    /*
     * 1. 介绍一下TCP和UDP? 工作在哪一层? TCP会如何保证自己是可靠传输?
     *
     * 2. 死锁是如何产生的? 如何避免
     *
     * 3. Linux进程和线程的联系和区别? 同一个线程共享了哪些东西? 进程间通信和线程间通信的区别?
     *
     * 4. 读取一个文件, 再经过socket发送到网络, 内存经过了几次拷贝?
     *
     * 5. 讲一下redis支持的常用数据类型, 列举一下分别可以用来做什么?
     *
     * 6. 什么是布隆过滤器? 使用场景是什么?
     *
     * 7. 进程间的通信方式有哪些?
     *
     * 8. TCP如何保证传输的可靠性?
     *
     * 9. 尽可能的列出熟悉和使用的linux命令和作用
     *
     * 10. http和https的区别
     *
     * 11. 什么叫做稳定的排序算法, 有什么是你知道的稳定排序算法
     *
     * 12. 什么叫跳表? 跳表有什么优缺点? 比较一下跳表和平衡二叉树?
     *
     * 13. 说说常见的设计模式, 举一个项目中觉得用的比较恰当的例子
     *
     * 14. http的状态码有哪些, 代表什么意思?
     *
     * 15. java中 == 与 equals 的区别
     *
     * 16. 简述几种排序算法
     *
     * 17. 哈希数据结构的实现原理, 哈希冲突问题的解决方式有哪些?
     *
     * 18. http的请求过程
     *
     * 19. 简述https认证的过程, 在交互的过程中, 至少用到了几组公钥私钥? 分别起到什么作用?
     *
     * 20. 简要说明os虚拟内存机制
     *
     * 21. Java线程池的理解, 如何创建? 核心参数及线程池工作原理
     *
     * 22. 聊一聊IO多路复用的三种实现方式: select, poll, epoll
     *
     * 23. Java中, 为什么重写equals时必须重写hashCode方法?
     *
     * 24. 平时开发的语言中会用到哪些数据结构? 有什么优缺点? hashMap冲突了怎么解决?
     *
     * 25. 用户态和内核态基础知识
     *
     * 26. 主键和唯一索引的区别
     *
     * 27. Java HashMap实现原理
     *
     * 28. Java中String, StringBuffer, StringBuilder的异同点
     *
     * 29. 什么是TCP窗口滑动机制?
     *
     * 30. 用户进程间通信主要有哪几种方式?
     *
     * 31. 虚拟内存是什么?
     *
     * 32. 简述几种Java容器类?
     *
     * 33. 长连接和短连接的区别
     *
     * 34. TCP为什么要三次握手? 而不是二次或者四次? 关闭为什么需要四次挥手?
     *
     * 35. 为什么推荐使用自增id作为主键?
     *
     * 36. 用过Redis的哪几种数据结构? zset是怎么实现的?
     *
     * 37. 栈和堆的区别, 为什么栈要快点?
     *
     * 38. 说明一下 强一致性, 弱一致性, 最终一致性的区别
     *
     * 39. 查看cpu的命令, 查看内存的命令, 内存里的buffer和cache的区别. 查看硬件的命令
     *
     * 40. HTTP常见状态码和缓存策略
     *
     * 41. HTTPS的工作原理
     *
     * 42. 进程和线程的区别? 浏览器的进程和线程是怎么样的?
     *
     * 43. 一次完整的http流程
     *
     * 44. GC是什么? 为什么要GC? 简述Java的回收机制
     *
     * 45. Java线程有几种状态? 分别代表什么含义?
     *
     * 46. Java中的volatile关键字的作用是什么?
     *
     * 47. Java中synchronized关键字可以修饰代码的哪些区域, 作用是什么?
     *
     * 48. Java中有哪些方式来使用多线程
     *
     * 49. 一个Java进程有两个线程, 一个线程OOM了, 另一个线程可以正常运行吗?
     *
     * 50. Java单例模式有哪几种实现方式?
     *
     *
     */
}
